jortband/ESP_HX8357K/ESP32_HX8357K.cpp
//Library for ESP32 fast SPI
#include <string.h>
#include <stdio.h>
#include "sdkconfig.h"
#include "rom/ets_sys.h"
#include "rom/gpio.h"
#include "soc/gpio_reg.h"
#include "soc/gpio_sig_map.h"
#include "esp32-hal-spi.h"
#include "esp32-hal.h"
//#include "soc/gpio_struct.h"
#include "soc/io_mux_reg.h"
#include "soc/spi_reg.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "soc/spi_reg.h"
#include "soc/spi_struct.h"
#include "Arduino.h"
#include "SPI.h"
#include "ESP32_HX8357K.h"

#define LCD_MISO 19
#define LCD_MOSI 23
#define LCD_CLK  18
#define LCD_CS   4
//TODO: CHECK IF CS IS WORKING
#define LCD_DC   17
#define LCD_RST  5
#define LCD_BCKL 25

#define SPI_MUTEX_LOCK()    do {} while (xSemaphoreTake(spi->lock, portMAX_DELAY) != pdPASS)
#define SPI_MUTEX_UNLOCK()  xSemaphoreGive(spi->lock)
struct spi_struct_t {
    spi_dev_t * dev;
#if !CONFIG_DISABLE_HAL_LOCKS
    xSemaphoreHandle lock;
#endif
    uint8_t num;
};

#define MSB_32_SET(var, val) { uint8_t * d = (uint8_t *)&(val); (var) = d[3] | (d[2] << 8) | (d[1] << 16) | (d[0] << 24); }
#define MSB_24_SET(var, val) { uint8_t * d = (uint8_t *)&(val); (var) = d[2] | (d[1] << 8) | (d[0] << 16); }
#define MSB_16_SET(var, val) { (var) = (((val) & 0xFF00) >> 8) | (((val) & 0xFF) << 8); }


ESP32_HX8357K::ESP32_HX8357K(){
  //do nothing here for now
  _width    = WIDTH;
	_height   = HEIGHT;
	rotation  = 0;
	cursor_y  = cursor_x    = 0;
	textsize  = 1;
	textcolor = textbgcolor = 0xFFFF;
	wrap      = true;
	font      = NULL;

}


void ESP32_HX8357K::begin(){
  //do initialisation here
  initGPIO();
  initSPI();
  initLCD();
  invertDisplay(false);
  //setRotation(0);
}

void ESP32_HX8357K::initGPIO(){
  pinMode(LCD_MISO,OUTPUT);
  pinMode(LCD_MOSI,OUTPUT);
  pinMode(LCD_CLK,OUTPUT);
  pinMode(LCD_CS,OUTPUT);
  pinMode(LCD_DC,OUTPUT);
  pinMode(LCD_RST,OUTPUT);
  digitalWrite(LCD_CS,LOW);
}

void ESP32_HX8357K::initSPI(){
  spi = spiStartBus(VSPI, 1000000, SPI_MODE0, SPI_MSBFIRST);
  spiAttachSCK(spi, LCD_CLK);
  spiAttachMISO(spi, LCD_MISO);
  spiAttachMOSI(spi, LCD_MOSI);
  spiAttachSS(spi, 0, LCD_CS);//if you want hardware SS
  spiEnableSSPins(spi, 1 << 0);//activate SS for CS0
  spiSSEnable(spi);
  spiSetClockDiv(spi, spiFrequencyToClockDiv(40000000));


}


void ESP32_HX8357K::initLCD(){
  //code for initialisation of LCD
  writeCommand(HX8357B_SETPOWER);
  writeByte(0x44);
  writeByte(0x41);
  writeByte(0x06);
  // seq_vcom
  writeCommand(HX8357B_SETVCOM);
  writeByte(0x40);
  writeByte(0x10);
  // seq_power_normal
  writeCommand(HX8357B_SETPWRNORMAL);
  writeByte(0x05);
  writeByte(0x12);
  // seq_panel_driving
  writeCommand(HX8357B_SET_PANEL_DRIVING);
  writeByte(0x14);
  writeByte(0x3b);
  writeByte(0x00);
  writeByte(0x02);
  writeByte(0x11);
  // seq_display_frame
  writeCommand(HX8357B_SETDISPLAYFRAME);
  writeByte(0x0c);  // 6.8mhz
  // seq_panel_related
  writeCommand(HX8357B_SETPANELRELATED);
  writeByte(0x01);  // BGR
  // seq_undefined1
  writeCommand(0xEA);
  writeByte(0x03);
  writeByte(0x00);
  writeByte(0x00);
  // undef2
  writeCommand(0xEB);
  writeByte(0x40);
  writeByte(0x54);
  writeByte(0x26);
  writeByte(0xdb);
  // seq_gamma
  writeCommand(HX8357B_SETGAMMA); // 0xC8
  writeByte(0x00);
  writeByte(0x15);
  writeByte(0x00);
  writeByte(0x22);
  writeByte(0x00);
  writeByte(0x08);
  writeByte(0x77);
  writeByte(0x26);
  writeByte(0x66);
  writeByte(0x22);
  writeByte(0x04);
  writeByte(0x00);

  // seq_addr mode
  writeCommand(HX8357_MADCTL);
  writeByte(0xC0);
  // pixel format
  writeCommand(HX8357_COLMOD);
  writeByte(0x55);

  // set up whole address box
  // paddr
  writeCommand(HX8357_PASET);
  writeByte(0x00);
  writeByte(0x00);
  writeByte(0x01);
  writeByte(0xDF);
  // caddr
  writeCommand(HX8357_CASET);
  writeByte(0x00);
  writeByte(0x00);
  writeByte(0x01);
  writeByte(0x3F);

  // display mode
  writeCommand(HX8357B_SETDISPMODE);
  writeByte(0x00); // CPU (DBI) and internal oscillation ??
  // exit sleep
  writeCommand(HX8357_SLPOUT);

  delay(120);
  // main screen turn on
  writeCommand(HX8357_DISPON);
  delay(10);

}

void ESP32_HX8357K::writeCommand(uint8_t command){
  spiWaitReady(spi);
  digitalWrite(LCD_DC, LOW);
  digitalWrite(LCD_CS, LOW);
  spiWriteByte(spi, command);
  //spiWrite(spi, uint32_t *data, uint8_t len);
  spiWaitReady(spi);
  digitalWrite(LCD_DC, HIGH);
}

void ESP32_HX8357K::writeData(uint32_t *data, uint8_t length){
  spiWrite(spi, data, length);
}

void ESP32_HX8357K::writeByte(uint8_t command){
  spiWriteByte(spi,command);
}

void ESP32_HX8357K::setAddr(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1){

  writeCommand(HX8357_CASET); // Column addr set
  //TODO: package data and send in one go

  uint32_t xAddr = x0<<16;
  xAddr |= x1;
  spiWriteLong(spi, xAddr);
  //writeData(uint32_t *data, uint8_t length)
  // spiWriteByte(spi, x0 >> 8);
  // spiWriteByte(spi, x0 & 0xFF);     // XSTART
  // spiWriteByte(spi, x1 >> 8);
  // spiWriteByte(spi, x1 & 0xFF);     // XEND

  writeCommand(HX8357_PASET); // Row addr set

  uint32_t yAddr = y0<<16;
  yAddr |=y1;
  spiWriteLong(spi, yAddr);
  // spiWriteByte(spi,y0>>8);
  // spiWriteByte(spi,y0);     // YSTART
  // spiWriteByte(spi,y1>>8);
  // spiWriteByte(spi,y1);     // YEND

  writeCommand(HX8357_RAMWR); // write to RAM
}

void ESP32_HX8357K::fillScreen(uint16_t color){
  //create a data set for filling the screen
  //this works bitches. 102ms
  uint32_t data[16];
  uint32_t compactColor = to32(color);
  setAddr(0, 0, _width -1, _height-1);
  //setup data
  for(int i = 0; i<16; i ++){
    data[i] = compactColor;
  }

  for(int i = 0; i<4800; i ++){
    spiWrite(spi, data,16);
    //writeData(data, 16);
  }
}

void ESP32_HX8357K::drawPixel(uint16_t x, uint16_t y, uint16_t color){
  if((x >= _width) || (y >= _height)) return;
  setAddr(x, y, x, y);
  spiWriteWord(spi, color);
}

void ESP32_HX8357K::drawFastVLine(uint16_t x, uint16_t y, uint16_t l, uint16_t color){
  if((x >= _width) || (y >= _height) || l ==0 ) return;
	if((y + l - 1) >= _width)  l = _width  - y;

  uint32_t data[16];
  uint32_t compactColor = to32(color);
  setAddr(x,y,x,y+l-1);
  //setup data
  for(int i = 0; i<16; i ++){
    data[i] = compactColor;
  }


