jortband/ESP_HX8357K/ESP32_HX8357K.cpp
  uint32_t itt = l>>5;
  for(uint32_t i = 0; i<itt; i ++ ){
      spiWrite(spi, data,16);
  }
  uint32_t rest = l%32;
  while (rest-- > 0) {
    spiWriteWord(spi, color);
  }

}

void ESP32_HX8357K::drawFastHLine(uint16_t x, uint16_t y, uint16_t l, uint16_t color){
  if((x >= _width) || (y >= _height)) return;
	if((x + l ) >= _width)  l = _width  - x;
  uint32_t data[16];
  uint32_t compactColor = to32(color);
  setAddr(x,y,x+l-1,y);
  //setup data
  for(int i = 0; i<16; i ++){
    data[i] = compactColor;
  }
  uint32_t itt = l>>5;
  for(uint32_t i = 0; i<itt; i ++ ){
    spiWrite(spi, data,16);
  }
  uint32_t rest = l%32;
  while (rest-- > 0) {
    spiWriteWord(spi, color);
  }

}

void ESP32_HX8357K::fillRect(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color){
  // if((x >= _width) || (y >= _height)) return;
	// if((x + w - 1) >= _width)  w = _width  - x;
	// if((y + h - 1) >= _height) h = _height - y;
  setAddr(x,y,x+w-1,y+h-1);
  //needs a faster way
  uint32_t data[16];
  uint32_t compactColor = to32(color);
  uint32_t itt = w*h>>5; // divide by 32 to account for number of itterations
  for(int i = 0 ; i<16; i ++){
    data[i] = compactColor;
  }
  if(itt>0){
    for(uint32_t i = 0 ; i < itt; i++){
      spiWrite(spi, data,16);
    }
  }

  //rest data
  uint32_t rItt = (w*h)&0x1F -1;
  for(int i = 0; i<rItt; i++){
    spiWriteWord(spi,color);
  }
}


void ESP32_HX8357K::drawLine(int16_t x0, int16_t y0,
	int16_t x1, int16_t y1, uint16_t color)
{
	if (y0 == y1) {
		if (x1 > x0) {
			drawFastHLine(x0, y0, x1 - x0 + 1, color);
		} else if (x1 < x0) {
			drawFastHLine(x1, y0, x0 - x1 + 1, color);
		} else {
			drawPixel(x0, y0, color);
		}
		return;
	} else if (x0 == x1) {
		if (y1 > y0) {
			drawFastVLine(x0, y0, y1 - y0 + 1, color);
		} else {
			drawFastVLine(x0, y1, y0 - y1 + 1, color);
		}
		return;
	}

	bool steep = abs(y1 - y0) > abs(x1 - x0);
	if (steep) {
		swap(x0, y0);
		swap(x1, y1);
	}
	if (x0 > x1) {
		swap(x0, x1);
		swap(y0, y1);
	}

	int16_t dx, dy;
	dx = x1 - x0;
	dy = abs(y1 - y0);

	int16_t err = dx / 2;
	int16_t ystep;

	if (y0 < y1) {
		ystep = 1;
	} else {
		ystep = -1;
	}

	int16_t xbegin = x0;
	if (steep) {
		for (; x0<=x1; x0++) {
			err -= dy;
			if (err < 0) {
				int16_t len = x0 - xbegin;
				if (len) {
					drawFastVLine(y0, xbegin, len + 1, color);
				} else {
					drawPixel(y0, x0, color);
				}
				xbegin = x0 + 1;
				y0 += ystep;
				err += dx;
			}
		}
		if (x0 > xbegin + 1) {
			drawFastVLine(y0, xbegin, x0 - xbegin, color);
		}

	} else {
		for (; x0<=x1; x0++) {
			err -= dy;
			if (err < 0) {
				int16_t len = x0 - xbegin;
				if (len) {
					drawFastHLine(xbegin, y0, len + 1, color);
				} else {
					drawPixel(x0, y0, color);
				}
				xbegin = x0 + 1;
				y0 += ystep;
				err += dx;
			}
		}
		if (x0 > xbegin + 1) {
			drawFastHLine(xbegin, y0, x0 - xbegin, color);
		}
	}
}

void ESP32_HX8357K::drawHLine(uint16_t x, uint16_t y, int16_t l, uint16_t color){

}

void ESP32_HX8357K::drawVLine(uint16_t x, uint16_t y, int16_t l, uint16_t color){

}

void ESP32_HX8357K::drawPixelNL(uint16_t x, uint16_t y, uint16_t color){
  if((x >= _width) || (y >= _height)) return;
  setAddrNL(x, x, y, y);
  spiWriteShortNL(spi, color);
}


void ESP32_HX8357K::fillRectVGradient(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color1, uint16_t color2){
  if((x >= _width) || (y >= _height) || w==0 || h == 0) return;
	if((x + w - 1) >= _width)  w = _width - x;
	if((y + h - 1) >= _height) h = _height- y;

  int32_t dr =(int16_t(colorR(color2)<<8) - int16_t(colorR(color1)<<8))/h;
  int32_t dg =(int16_t(colorG(color2)<<8) - int16_t(colorG(color1)<<8))/h;
  int32_t db =(int16_t(colorB(color2)<<8) - int16_t(colorB(color1)<<8))/h;

  uint16_t br = colorR(color1);
  uint16_t bg = colorG(color1);
  uint16_t bb = colorB(color1);

  for(uint32_t i = 0; i < h; i ++){
    uint16_t r = br + ((dr*i)>>8);
    uint16_t g = bg + ((dg*i)>>8);
    uint16_t b = bb + ((db*i)>>8);


    uint16_t finalColor = r<<11;
    finalColor |=g<<5;
    finalColor |= b;
    drawFastHLine(x,y+i,w, finalColor);
  }

}

void ESP32_HX8357K::fillRectHGradient(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color1, uint16_t color2){
  if((x >= _width) || (y >= _height) || w==0 || h== 0) return;
  if((x + w - 1) >= _width)  w = _width - x;
  if((y + h - 1) >= _height) h = _height - y;

  int32_t dr =(int16_t(colorR(color2)<<8) - int16_t(colorR(color1)<<8))/w;
  int32_t dg =(int16_t(colorG(color2)<<8) - int16_t(colorG(color1)<<8))/w;
  int32_t db =(int16_t(colorB(color2)<<8) - int16_t(colorB(color1)<<8))/w;

  uint16_t br = colorR(color1);
  uint16_t bg = colorG(color1);
  uint16_t bb = colorB(color1);

  for(uint32_t i = 0; i < w; i ++){
    uint32_t r = br + ((dr*i)>>8);
    uint32_t g = bg + ((dg*i)>>8);
    uint32_t b = bb + ((db*i)>>8);


    uint16_t finalColor = r<<11;
    finalColor |=g<<5;
    finalColor |= b;
    drawFastVLine(x + i,y,h , finalColor);
  }
}

void ESP32_HX8357K::fillScreenVGradient(uint16_t color1, uint16_t color2){
  fillRectVGradient(0, 0, _width, _height, color1, color2);
}
void ESP32_HX8357K::fillScreenHGradient(uint16_t color1, uint16_t color2){
  fillRectHGradient(0, 0, _width, _height, color1, color2);
}

/*
This is the core graphics library for all our displays, providing a common
set of graphics primitives (points, lines, circles, etc.).  It needs to be
paired with a hardware-specific library for each display device we carry
(to handle the lower-level functions).
Adafruit invests time and resources providing this open source code, please
support Adafruit & open-source hardware by purchasing products from Adafruit!
Copyright (c) 2013 Adafruit Industries.  All rights reserved.
Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:
- Redistributions of source code must retain the above copyright notice,
  this list of conditions and the following disclaimer.
- Redistributions in binary form must reproduce the above copyright notice,
  this list of conditions and the following disclaimer in the documentation
  and/or other materials provided with the distribution.
THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.
*/

//#include "glcdfont.c"
extern "C" const unsigned char glcdfont[];


void ESP32_HX8357K::drawCircle(int16_t x0, int16_t y0, int16_t r,
    uint16_t color) {
  int16_t f = 1 - r;
  int16_t ddF_x = 1;
  int16_t ddF_y = -2 * r;
  int16_t x = 0;
  int16_t y = r;

