jortband/ESP_HX8357K/ESP32_HX8357K.cpp
uint16_t ESP32_HX8357K::color565(uint8_t r, uint8_t g, uint8_t b) {
  uint16_t res = (b & 0xF8) << 8;
  res |=(g & 0xFC) << 3;
  res |= r>>3;
  return res;
}

uint16_t ESP32_HX8357K::colorR(uint16_t color){
  uint16_t res = color>>11;
  return res;
}
uint16_t ESP32_HX8357K::colorG(uint16_t color){
  uint16_t res = color>>5;
  res &=0x3F;
  return res;
}
uint16_t ESP32_HX8357K::colorB(uint16_t color){
  uint16_t res =  color&0x1F;
  return res;
}

uint32_t ESP32_HX8357K::to32(uint16_t color){
  uint16_t hi = color>>8;
  uint16_t lo = color&0xFF;
  uint16_t revColor = (lo<<8) + hi;

  uint32_t c = revColor<<16;
  c += revColor;
  return c;
}


//faster pixel write implementation
void ESP32_HX8357K::spiSimpleTransaction(spi_t * spi)
{
    if(!spi) {
        return;
    }
    SPI_MUTEX_LOCK();
}

void ESP32_HX8357K::spiEndTransaction(spi_t * spi)
{
    if(!spi) {
        return;
    }
    SPI_MUTEX_UNLOCK();
}

uint16_t ESP32_HX8357K::spiTransferShortNL(spi_t * spi, uint16_t data)
{
    if(!spi) {
        return 0;
    }
    if(!spi->dev->ctrl.wr_bit_order){
        MSB_16_SET(data, data);
    }
    spi->dev->mosi_dlen.usr_mosi_dbitlen = 15;
    spi->dev->miso_dlen.usr_miso_dbitlen = 15;
    spi->dev->data_buf[0] = data;
    spi->dev->cmd.usr = 1;
    while(spi->dev->cmd.usr);
    data = spi->dev->data_buf[0] & 0xFFFF;
    if(!spi->dev->ctrl.rd_bit_order){
        MSB_16_SET(data, data);
    }
    return data;
}

void ESP32_HX8357K::spiWriteShortNL(spi_t * spi, uint16_t data)
{
    if(!spi) {
        return;
    }
    if(!spi->dev->ctrl.wr_bit_order){
        MSB_16_SET(data, data);
    }
    spi->dev->mosi_dlen.usr_mosi_dbitlen = 15;
    spi->dev->miso_dlen.usr_miso_dbitlen = 0;
    spi->dev->data_buf[0] = data;
    spi->dev->cmd.usr = 1;
    while(spi->dev->cmd.usr);
}

void spiWriteByteNL(spi_t * spi, uint8_t data)
{
    if(!spi) {
        return;
    }
    spi->dev->mosi_dlen.usr_mosi_dbitlen = 7;
    spi->dev->miso_dlen.usr_miso_dbitlen = 0;
    spi->dev->data_buf[0] = data;
    spi->dev->cmd.usr = 1;
    while(spi->dev->cmd.usr);
}

void ESP32_HX8357K::setAddrNL(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1){
  digitalWrite(LCD_DC, LOW);
  spiWriteByteNL(spi, HX8357_CASET);
  digitalWrite(LCD_DC, HIGH);

  //writeCommand(HX8357_CASET); // Column addr set
  //TODO: package data and send in one go

  //writeData(uint32_t *data, uint8_t length)
  spiWriteShortNL(spi,x0);
  spiWriteShortNL(spi,x1);

  digitalWrite(LCD_DC, LOW);
  spiWriteByteNL(spi, HX8357_PASET);
  digitalWrite(LCD_DC, HIGH);

  spiWriteShortNL(spi,y0);
  spiWriteShortNL(spi,y1);

  digitalWrite(LCD_DC, LOW);
  spiWriteByteNL(spi, HX8357_RAMWR);  //write to ram
  digitalWrite(LCD_DC, HIGH);

}


void ESP32_HX8357K::drawBitmap(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t *bmap){
  setAddr(x, y, x+w-1, y+h-1);
  //now calculate the amount of bits that can be transferred through fast writing
  uint16_t itt = (w*h)>>5;
  uint16_t rest = (w*h)%32;
  uint32_t dataSet[16];
  for(int i = 0 ; i < itt; i++){
    for(int j = 0; j<32; j+=2){
      uint16_t cLoc = (i*16) + (j>>1);

      dataSet[cLoc] = bmap[j+i*32]<<16;
      dataSet[cLoc] |= bmap[j+1 + i*32];
    }
    spiWrite(spi,dataSet,16);
  }

  for(int i = 0; i<rest; i ++){
    spiWriteWord(spi, bmap[i+itt*32]);
  }

}
// size_t ESP32_HX8357K::print(const __FlashStringHelper *ifsh)
// {
//   PGM_P p = reinterpret_cast<PGM_P>(ifsh);
//   size_t n = 0;
//   while (1) {
//     unsigned char c = pgm_read_byte(p++);
//     if (c == 0) break;
//     if (write(c)) n++;
//     else break;
//   }
//   return n;
// }
//
// size_t ESP32_HX8357K::print(const String &s)
// {
//   return write(s.c_str(), s.length());
// }
//
// size_t ESP32_HX8357K::print(const char str[])
// {
//   return write(str);
// }
//
// size_t ESP32_HX8357K::print(char c)
// {
//   return write(c);
// }
//
// size_t ESP32_HX8357K::print(unsigned char b, int base)
// {
//   return print((unsigned long) b, base);
// }
//
// size_t ESP32_HX8357K::print(int n, int base)
// {
//   return print((long) n, base);
// }
//
// size_t ESP32_HX8357K::print(unsigned int n, int base)
// {
//   return print((unsigned long) n, base);
// }
//
// size_t ESP32_HX8357K::print(long n, int base)
// {
//   if (base == 0) {
//     return write(n);
//   } else if (base == 10) {
//     if (n < 0) {
//       int t = print('-');
//       n = -n;
//       return printNumber(n, 10) + t;
//     }
//     return printNumber(n, 10);
//   } else {
//     return printNumber(n, base);
//   }
// }
//
// size_t ESP32_HX8357K::print(unsigned long n, int base)
// {
//   if (base == 0) return write(n);
//   else return printNumber(n, base);
// }
//
// size_t ESP32_HX8357K::print(double n, int digits)
// {
//   return printFloat(n, digits);
// }
//
// size_t ESP32_HX8357K::println(const __FlashStringHelper *ifsh)
// {
//   size_t n = print(ifsh);
//   n += println();
//   return n;
// }
//
// size_t ESP32_HX8357K::print(const Printable& x)
// {
//   return x.printTo(*this);
// }
//
// size_t ESP32_HX8357K::println(void)
// {
//   return write("\r\n");
// }
//
// size_t ESP32_HX8357K::println(const String &s)
// {
//   size_t n = print(s);
//   n += println();
//   return n;
// }
//
// size_t ESP32_HX8357K::println(const char c[])
// {
//   size_t n = print(c);
//   n += println();
//   return n;
// }
//
// size_t ESP32_HX8357K::println(char c)
// {
//   size_t n = print(c);
//   n += println();
//   return n;
// }
//
// size_t ESP32_HX8357K::println(unsigned char b, int base)
// {
//   size_t n = print(b, base);
//   n += println();
//   return n;
// }
//
// size_t ESP32_HX8357K::println(int num, int base)
// {
//   size_t n = print(num, base);
//   n += println();
//   return n;
// }
//
// size_t ESP32_HX8357K::println(unsigned int num, int base)
// {
//   size_t n = print(num, base);
//   n += println();
//   return n;
// }
//
// size_t ESP32_HX8357K::println(long num, int base)
// {
//   size_t n = print(num, base);
//   n += println();
//   return n;
// }
//
// size_t ESP32_HX8357K::println(unsigned long num, int base)
// {
//   size_t n = print(num, base);
//   n += println();
//   return n;
// }
//
// size_t ESP32_HX8357K::println(double num, int digits)
// {
//   size_t n = print(num, digits);
//   n += println();
//   return n;
// }
//
// size_t ESP32_HX8357K::println(const Printable& x)
// {
//   size_t n = print(x);
//   n += println();
//   return n;
// }
